test.yml
execution:
- iterations: 50
  concurrency: 10
  scenario: with_script

scenarios:
  with_script:
    script: poc.jmx

reporting:
- module: console
- module: final-stats
  summary: true
  percentiles: true 
  failed-labels: false
  test-duration: true

#- module: blazemeter
#  token: c7aad1afbe12e1400463c8f7:d60fcd98039a6fee43434202222784faa165c96b718f978475399e3cea6530e336a5fd70
#  report-name: Taurus test report
#  test: Taurus test
#  project: Taurus test project

- module: blazemeter
  token: c7aad1afbe12e1400463c8f7:d60fcd98039a6fee43434202222784faa165c96b718f978475399e3cea6530e336a5fd70
    jmeter:
    #--- the custom or local jmeter location (this is if you don't want Taurus to download automatically the latest version of JMeter)
    path: /deployments/apache-jmeter
    #--- JMeter memory configuration
    memory-xmx: 500MB
    version: 5.0
    properties:
      log_level: DEBUG
  console:
    disable: false