test.yml
execution:
- iterations: 50
  concurrency: 10
  scenario: with_script

scenarios:
  with_script:
    script: poc.jmx

reporting:
- module: console
- module: final-stats
  summary: true
  percentiles: true 
  failed-labels: false
  test-duration: true

- module: blazemeter
  token: c7aad1afbe12e1400463c8f7:d60fcd98039a6fee43434202222784faa165c96b718f978475399e3cea6530e336a5fd70
  report-name: Taurus test report
  test: Taurus test
  project: Taurus test project